''' 
프린터 고장 내기
나는 친구 회사에 프린터를 고장내고 싶어요
프린터는 요청한 순서대로 프린터를 하는 것이 아니라 2개의 프린터를 하고, 3 번째 작업은 맨 뒤에 출력되게 만들자
이때 맨 마지막에 출력되는 작업은?
    - [1, 2, 3, 4, 5, 6, 7, 8, 9]
    - 마지막에 출력되는 작업 넘버는? 무엇일까?
    - [`10**,** 32**,** 12**,** 67**,** 8**,** 34**,** 98**,** 282**,** 12**,** 93**,** 25**,** 44**,** 92**,** 100`]
    
    `print(solution([1**,** 2**,** 3**,** 4**,** 5**,** 6**,** 7**,** 8**,** 9]))`
    
    `print(solution([10**,** 32**,** 12**,** 67**,** 8**,** 34**,** 98**,** 282**,** 12**,** 93**,** 25**,** 44**,** 92**,** 100]))`
    
    출력 값: 9, 44
'''